In [2]:
# DS part1

In [3]:
# import libaray
import pandas as pd

### DataFrame

In [4]:
# {keys : columns name, values : row in columns, values of columns}
df = pd.DataFrame(data = {
    'apples':[2,4,9],
    'oranges': [4,3,8]
})
df

   apples  oranges
0       2        4
1       4        3
2       9        8

### Series

In [5]:
s1 = pd.Series([2,4,3])
s1

0    2
1    4
2    3
dtype: int64

In [6]:
s2 = pd.Series(['a','b','c'])
s2

0    a
1    b
2    c
dtype: object

In [7]:
s3 = pd.Series([1.2,2.4,4.3])
s3

0    1.2
1    2.4
2    4.3
dtype: float64

In [8]:
# collect all serises
df = pd.DataFrame(data = {
    'A' : [2,4,3],
    'B': ['a','b','c'],
    'C': [1.2,2.4,4.3]
}, index =['James', 'Dived', 'Sayed'])
df

       A  B    C
James  2  a  1.2
Dived  4  b  2.4
Sayed  3  c  4.3

## How select row or column from DataFrame or Series??

In [9]:
# select columns
df['A']

James    2
Dived    4
Sayed    3
Name: A, dtype: int64

In [10]:
# column b
df.B

James    a
Dived    b
Sayed    c
Name: B, dtype: object

In [11]:
# select row Using loc
df.loc['James']

A      2
B      a
C    1.2
Name: James, dtype: object

In [12]:
# can be select more than one columns
df[['A','C']]

       A    C
James  2  1.2
Dived  4  2.4
Sayed  3  4.3

In [13]:
# can be select more than one row
df.loc[['James','Sayed']]

       A  B    C
James  2  a  1.2
Sayed  3  c  4.3

## how read data from csv file by Using read_csv

In [14]:
data = pd.read_csv('../dataset/purchases.csv')
data

  Unnamed: 0  apples  oranges
0       June       3        0
1     Robert       2        3
2       Lily       0        7
3      David       1        2

In [15]:
# set index when reading data
df = pd.read_csv('../dataset/purchases.csv', index_col=0)
df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [16]:
# descibe method
df.describe()

         apples  oranges
count  4.000000  4.00000
mean   1.500000  3.00000
std    1.290994  2.94392
min    0.000000  0.00000
25%    0.750000  1.50000
50%    1.500000  2.50000
75%    2.250000  4.00000
max    3.000000  7.00000